<?php
	$groups = array("ЛП-17-1", "ЛП-17-2", "ТМ-17-1", "ТМ-17-1", "ТО-17-1", "АД-17-1", "АД-17-2", "УК-17-1", "АП-17-1","РП-17-1","МХ-17-1","КС-17-1","ПИ-17-1","ИС-17-1","ИС-17-2","ЭК-17-1");

	$group1 = array("Сафонов Захар Степанович", "Зыков Рубен Константинович","Кабанов Адриан Робертович","Киселёв Трофим Геннадиевич","Уваров Андрей Мэлсович","Осипов Ермолай Германович","Романов Яков Тимофеевич","Сафонов Леонард Александрович","Голубев Михаил Альбертович","Зуев Кассиан Геласьевич","Кондратьев Мстислав Тимурович","Авдеев Сергей Филатович","Ефремов Азарий Антонинович","Артемьев Ираклий Авксентьевич","Осипов Рудольф Борисович");
	
	$group2 = array("Селезнёв Аввакум Дмитрьевич","Попов Адриан Фролович","Панфилов Глеб Даниилович","Кабанов Назарий Натанович","Филиппов Клемент Ильяович","Юдин Ипполит Семёнович","Елисеев Юлиан Иосифович","Гордеев Гордей Протасьевич","Исаев Роберт Ярославович","Трофимов Любомир Донатович","Титов Вальтер Константинович","Селиверстов Адам Германнович","Тимофеев Рудольф Михайлович","Трофимов Степан Тимофеевич","Филиппов Макар Филиппович");

	$group3 = array("Мартынов Роман Проклович","Шестаков Венедикт Наумович","Харитонов Ким Владиславович","Гуляев Гордей Георгьевич","Буров Матвей Васильевич","Антонов Герман Тимофеевич","Никитин Людвиг Александрович","Носков Власий Олегович","Рогов Аким Ростиславович","Марков Григорий Мэлорович","Куликов Рудольф Макарович","Лыткин Илларион Альбертович","Сазонов Вениамин Еремеевич","Стрелков Арсен Степанович","Иванов Михаил Геннадиевич");
	
	$group4 = array("Цветков Илларион Глебович","Галкин Станислав Иосифович","Субботин Павел Андреевич","Королёв Людвиг Робертович","Некрасов Арсен Рубенович","Калинин Герасим Антонович","Попов Владислав Романович","Савельев Мирон Сергеевич","Дьячков Федор Львович","Макаров Мартын Святославович","Хохлов Пантелеймон Петрович","Кузнецов Панкратий Дмитриевич","Субботин Казимир Якунович","Голубев Альфред Глебович","Гурьев Ираклий Митрофанович");
	
	$group5 = array("Сафонов Захар Степанович", "Зыков Рубен Константинович","Кабанов Адриан Робертович","Киселёв Трофим Геннадиевич","Уваров Андрей Мэлсович","Осипов Ермолай Германович","Романов Яков Тимофеевич","Сафонов Леонард Александрович","Голубев Михаил Альбертович","Зуев Кассиан Геласьевич","Кондратьев Мстислав Тимурович","Авдеев Сергей Филатович","Ефремов Азарий Антонинович","Артемьев Ираклий Авксентьевич","Осипов Рудольф Борисович");
	
	$group6 = array("Селезнёв Аввакум Дмитрьевич","Попов Адриан Фролович","Панфилов Глеб Даниилович","Кабанов Назарий Натанович","Филиппов Клемент Ильяович","Юдин Ипполит Семёнович","Елисеев Юлиан Иосифович","Гордеев Гордей Протасьевич","Исаев Роберт Ярославович","Трофимов Любомир Донатович","Титов Вальтер Константинович","Селиверстов Адам Германнович","Тимофеев Рудольф Михайлович","Трофимов Степан Тимофеевич","Филиппов Макар Филиппович");

	$group7 = array("Мартынов Роман Проклович","Шестаков Венедикт Наумович","Харитонов Ким Владиславович","Гуляев Гордей Георгьевич","Буров Матвей Васильевич","Антонов Герман Тимофеевич","Никитин Людвиг Александрович","Носков Власий Олегович","Рогов Аким Ростиславович","Марков Григорий Мэлорович","Куликов Рудольф Макарович","Лыткин Илларион Альбертович","Сазонов Вениамин Еремеевич","Стрелков Арсен Степанович","Иванов Михаил Геннадиевич");
	
	$group8 = array("Цветков Илларион Глебович","Галкин Станислав Иосифович","Субботин Павел Андреевич","Королёв Людвиг Робертович","Некрасов Арсен Рубенович","Калинин Герасим Антонович","Попов Владислав Романович","Савельев Мирон Сергеевич","Дьячков Федор Львович","Макаров Мартын Святославович","Хохлов Пантелеймон Петрович","Кузнецов Панкратий Дмитриевич","Субботин Казимир Якунович","Голубев Альфред Глебович","Гурьев Ираклий Митрофанович");
	
	$group9 = array("Сафонов Захар Степанович", "Зыков Рубен Константинович","Кабанов Адриан Робертович","Киселёв Трофим Геннадиевич","Уваров Андрей Мэлсович","Осипов Ермолай Германович","Романов Яков Тимофеевич","Сафонов Леонард Александрович","Голубев Михаил Альбертович","Зуев Кассиан Геласьевич","Кондратьев Мстислав Тимурович","Авдеев Сергей Филатович","Ефремов Азарий Антонинович","Артемьев Ираклий Авксентьевич","Осипов Рудольф Борисович");
	
	$group10 = array("Селезнёв Аввакум Дмитрьевич","Попов Адриан Фролович","Панфилов Глеб Даниилович","Кабанов Назарий Натанович","Филиппов Клемент Ильяович","Юдин Ипполит Семёнович","Елисеев Юлиан Иосифович","Гордеев Гордей Протасьевич","Исаев Роберт Ярославович","Трофимов Любомир Донатович","Титов Вальтер Константинович","Селиверстов Адам Германнович","Тимофеев Рудольф Михайлович","Трофимов Степан Тимофеевич","Филиппов Макар Филиппович");

	$group11 = array("Мартынов Роман Проклович","Шестаков Венедикт Наумович","Харитонов Ким Владиславович","Гуляев Гордей Георгьевич","Буров Матвей Васильевич","Антонов Герман Тимофеевич","Никитин Людвиг Александрович","Носков Власий Олегович","Рогов Аким Ростиславович","Марков Григорий Мэлорович","Куликов Рудольф Макарович","Лыткин Илларион Альбертович","Сазонов Вениамин Еремеевич","Стрелков Арсен Степанович","Иванов Михаил Геннадиевич");
	
	$group12 = array("Цветков Илларион Глебович","Галкин Станислав Иосифович","Субботин Павел Андреевич","Королёв Людвиг Робертович","Некрасов Арсен Рубенович","Калинин Герасим Антонович","Попов Владислав Романович","Савельев Мирон Сергеевич","Дьячков Федор Львович","Макаров Мартын Святославович","Хохлов Пантелеймон Петрович","Кузнецов Панкратий Дмитриевич","Субботин Казимир Якунович","Голубев Альфред Глебович","Гурьев Ираклий Митрофанович");
	
	$group13 = array("Сафонов Захар Степанович", "Зыков Рубен Константинович","Кабанов Адриан Робертович","Киселёв Трофим Геннадиевич","Уваров Андрей Мэлсович","Осипов Ермолай Германович","Романов Яков Тимофеевич","Сафонов Леонард Александрович","Голубев Михаил Альбертович","Зуев Кассиан Геласьевич","Кондратьев Мстислав Тимурович","Авдеев Сергей Филатович","Ефремов Азарий Антонинович","Артемьев Ираклий Авксентьевич","Осипов Рудольф Борисович");
	
	$group14 = array("Селезнёв Аввакум Дмитрьевич","Попов Адриан Фролович","Панфилов Глеб Даниилович","Кабанов Назарий Натанович","Филиппов Клемент Ильяович","Юдин Ипполит Семёнович","Елисеев Юлиан Иосифович","Гордеев Гордей Протасьевич","Исаев Роберт Ярославович","Трофимов Любомир Донатович","Титов Вальтер Константинович","Селиверстов Адам Германнович","Тимофеев Рудольф Михайлович","Трофимов Степан Тимофеевич","Филиппов Макар Филиппович");

	$group15 = array("Мартынов Роман Проклович","Шестаков Венедикт Наумович","Харитонов Ким Владиславович","Гуляев Гордей Георгьевич","Буров Матвей Васильевич","Антонов Герман Тимофеевич","Никитин Людвиг Александрович","Носков Власий Олегович","Рогов Аким Ростиславович","Марков Григорий Мэлорович","Куликов Рудольф Макарович","Лыткин Илларион Альбертович","Сазонов Вениамин Еремеевич","Стрелков Арсен Степанович","Иванов Михаил Геннадиевич");
	
	$group16 = array("Цветков Илларион Глебович","Галкин Станислав Иосифович","Субботин Павел Андреевич","Королёв Людвиг Робертович","Некрасов Арсен Рубенович","Калинин Герасим Антонович","Попов Владислав Романович","Савельев Мирон Сергеевич","Дьячков Федор Львович","Макаров Мартын Святославович","Хохлов Пантелеймон Петрович","Кузнецов Панкратий Дмитриевич","Субботин Казимир Якунович","Голубев Альфред Глебович","Гурьев Ираклий Митрофанович");

	if(isset($_GET["groups"])) {
		for($i=0; $i < count($groups); $i++) {
			echo $i.":".$groups[$i];
			if($i < count($groups)-1) echo ';';
		}
	} else if(isset($_GET["group"])) {
		if($_GET["group"] == "0") {
			for($i=0; $i < count($group1); $i++) {
			
				echo $i.":".$group1[$i];
				if($i < count($group1)-1) echo ';';
			}
		}
		if($_GET["group"] == "1") {
			for($i=0; $i < count($group2); $i++) {
			
				echo $i.":".$group2[$i];
				if($i < count($group2)-1) echo ';';
			}
		}
		if($_GET["group"] == "2") {
			for($i=0; $i < count($group3); $i++) {
			
				echo $i.":".$group3[$i];
				if($i < count($group3)-1) echo ';';
			}
		}
		if($_GET["group"] == "3") {
			for($i=0; $i < count($group4); $i++) {
			
				echo $i.":".$group4[$i];
				if($i < count($group4)-1) echo ';';
			}
		}
		if($_GET["group"] == "4") {
			for($i=0; $i < count($group5); $i++) {
			
				echo $i.":".$group5[$i];
				if($i < count($group5)-1) echo ';';
			}
		}
		if($_GET["group"] == "5") {
			for($i=0; $i < count($group6); $i++) {
			
				echo $i.":".$group6[$i];
				if($i < count($group6)-1) echo ';';
			}
		}
		if($_GET["group"] == "6") {
			for($i=0; $i < count($group7); $i++) {
			
				echo $i.":".$group7[$i];
				if($i < count($group7)-1) echo ';';
			}
		}
		if($_GET["group"] == "7") {
			for($i=0; $i < count($group8); $i++) {
			
				echo $i.":".$group8[$i];
				if($i < count($group8)-1) echo ';';
			}
		}
		if($_GET["group"] == "8") {
			for($i=0; $i < count($group9); $i++) {
			
				echo $i.":".$group9[$i];
				if($i < count($group9)-1) echo ';';
			}
		}
		if($_GET["group"] == "9") {
			for($i=0; $i < count($group10); $i++) {
			
				echo $i.":".$group10[$i];
				if($i < count($group10)-1) echo ';';
			}
		}
		if($_GET["group"] == "10") {
			for($i=0; $i < count($group11); $i++) {
			
				echo $i.":".$group11[$i];
				if($i < count($group11)-1) echo ';';
			}
		}
		if($_GET["group"] == "11") {
			for($i=0; $i < count($group12); $i++) {
			
				echo $i.":".$group12[$i];
				if($i < count($group12)-1) echo ';';
			}
		}
		if($_GET["group"] == "12") {
			for($i=0; $i < count($group13); $i++) {
			
				echo $i.":".$group13[$i];
				if($i < count($group13)-1) echo ';';
			}
		}
		if($_GET["group"] == "13") {
			for($i=0; $i < count($group14); $i++) {
			
				echo $i.":".$group14[$i];
				if($i < count($group14)-1) echo ';';
			}
		}
		if($_GET["group"] == "14") {
			for($i=0; $i < count($group15); $i++) {
			
				echo $i.":".$group15[$i];
				if($i < count($group15)-1) echo ';';
			}
		}
		if($_GET["group"] == "15") {
			for($i=0; $i < count($group16); $i++) {
			
				echo $i.":".$group16[$i];
				if($i < count($group16)-1) echo ';';
			}
		}
	} else {
		echo "Данное API позволяет получать данные о студентах техникума.";
		echo "<br>Для того, чтобы использовать данное API, необходимо передать на данную страницу GET запрос.";
		echo "<br><br><b>groups</b> -  предоставляет список всех групп, находящихся на данный момент в техникуме:";
		echo "<br>Пример запроса: <a href='http://localhost/api/index.php?groups'>http://localhost/api/index.php?groups</a>";
		echo "<br><br><b>group=id</b> -  предоставляет список всех студентов, находящихся на данный момент в группе";
		echo "<br>Пример запроса: <a href='http://localhost/api/index.php?group=0'>http://localhost/api/index.php?group=0</a>";
	}

?>